Revit 2017 API
DirectShape.CreateElement Method
Overload List
Name | Description
CreateElement(Document, ElementId)
 Creates a DirectShape object and adds it to document.
CreateElement(Document, ElementId, String, String) |  Obsolete.
 Creates a DirectShape object and adds it to document.
See Also
DirectShape Class
DirectShape Members
Autodesk.Revit.DB Namespace